```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=rVB1x]
module.serverless-example-api.module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=781149127351]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-08-14 03:40:44.781991003 +0000 UTC]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-08-14 03:40:44.632198228 +0000 UTC]
module.api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2003416470]
module.api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws_logging.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      ~ account_id = "781149127351" -> (known after apply)
      ~ arn        = "arn:aws:sts::781149127351:assumed-role/BootstrapAccessRole/1597380377373470762" -> (known after apply)
      ~ id         = "2020-08-14 04:46:18.159294598 +0000 UTC" -> (known after apply)
      ~ user_id    = "AROA3LYA5YK3TP6QOXX3M:1597380377373470762" -> (known after apply)
    }

  # module.aws_logging.data.aws_iam_policy_document.bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy"  {
      ~ id      = "2003416470" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringEquals = {
                              - s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = [
                              - "delivery.logs.amazonaws.com",
                              - "cloudtrail.amazonaws.com",
                            ]
                        }
                      - Resource  = "arn:aws:s3:::scaffoldly-rVB1x-logs/AWSLogs/781149127351/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = "s3:GetBucketAcl"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = [
                              - "delivery.logs.amazonaws.com",
                              - "cloudtrail.amazonaws.com",
                            ]
                        }
                      - Resource  = "arn:aws:s3:::scaffoldly-rVB1x-logs"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
            actions       = [
                "s3:PutObject",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::scaffoldly-rVB1x-logs/AWSLogs/781149127351/*",
              ~ (known after apply),
            ]

            condition {
                test     = "StringEquals"
                values   = [
                    "bucket-owner-full-control",
                ]
                variable = "s3:x-amz-acl"
            }

            principals {
                identifiers = [
                    "cloudtrail.amazonaws.com",
                    "delivery.logs.amazonaws.com",
                ]
                type        = "Service"
            }
        }
      ~ statement {
            actions       = [
                "s3:GetBucketAcl",
            ]
          - effect        = "Allow" -> null
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::scaffoldly-rVB1x-logs",
              ~ (known after apply),
            ]

            principals {
                identifiers = [
                    "cloudtrail.amazonaws.com",
                    "delivery.logs.amazonaws.com",
                ]
                type        = "Service"
            }
        }
    }

  # module.aws_logging.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      ~ dns_suffix = "amazonaws.com" -> (known after apply)
      ~ id         = "2020-08-14 04:46:18.011009855 +0000 UTC" -> (known after apply)
      ~ partition  = "aws" -> (known after apply)
    }

  # module.aws_logging.aws_cloudtrail.cloudtrail will be created
  + resource "aws_cloudtrail" "cloudtrail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "cloudtrail"
      + s3_bucket_name                = (known after apply)

      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::S3::Object"
              + values = (known after apply)
            }
        }
      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::Lambda::Function"
              + values = (known after apply)
            }
        }
    }

  # module.aws_logging.aws_s3_bucket.logs will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + noncurrent_version_transition {
              + days          = 180
              + storage_class = "DEEP_ARCHIVE"
            }
          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + noncurrent_version_transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.aws_logging.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.aws_organization.aws_organizations_account.account must be replaced
+/- resource "aws_organizations_account" "account" {
      ~ arn              = "arn:aws:organizations::625384516859:account/o-p17ed8s84p/781149127351" -> (known after apply)
      ~ email            = "aws+scaffoldly-rVB1x@cnuss.com" -> (known after apply) # forces replacement
      ~ id               = "781149127351" -> (known after apply)
      ~ joined_method    = "CREATED" -> (known after apply)
      ~ joined_timestamp = "2020-08-14T02:54:06Z" -> (known after apply)
      ~ name             = "scaffoldly-rVB1x" -> (known after apply) # forces replacement
      ~ parent_id        = "r-agni" -> (known after apply)
        role_name        = "BootstrapAccessRole"
      ~ status           = "ACTIVE" -> (known after apply)
      - tags             = {} -> null
    }

  # module.aws_organization.random_string.random must be replaced
+/- resource "random_string" "random" {
      ~ id          = "rVB1x" -> (known after apply)
      ~ length      = 5 -> 4 # forces replacement
        lower       = true
        min_lower   = 0
        min_numeric = 0
        min_special = 0
        min_upper   = 0
        number      = true
      ~ result      = "rVB1x" -> (known after apply)
        special     = false
      ~ upper       = true -> false # forces replacement
    }

  # module.dns.aws_route53_delegation_set.main will be created
  + resource "aws_route53_delegation_set" "main" {
      + id           = (known after apply)
      + name_servers = (known after apply)
    }

  # module.dns.module.dns[0].aws_acm_certificate.apex_wildcard will be created
  + resource "aws_acm_certificate" "apex_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[0].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[0].aws_route53_record.apex_wildcard["scaffoldly.dev"] will be created
  + resource "aws_route53_record" "apex_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.dns.module.dns[0].aws_route53_record.subdomain_wildcard["*.scaffoldly.dev"] will be created
  + resource "aws_route53_record" "subdomain_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.dns.module.dns[0].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment           = "Managed by Terraform"
      + delegation_set_id = (known after apply)
      + force_destroy     = false
      + id                = (known after apply)
      + name              = "scaffoldly.dev"
      + name_servers      = (known after apply)
      + zone_id           = (known after apply)
    }

  # module.dns.module.dns[1].aws_acm_certificate.apex_wildcard will be created
  + resource "aws_acm_certificate" "apex_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[1].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[1].aws_route53_record.apex_wildcard["scaffold.ly"] will be created
  + resource "aws_route53_record" "apex_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.dns.module.dns[1].aws_route53_record.subdomain_wildcard["*.scaffold.ly"] will be created
  + resource "aws_route53_record" "subdomain_wildcard" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.dns.module.dns[1].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment           = "Managed by Terraform"
      + delegation_set_id = (known after apply)
      + force_destroy     = false
      + id                = (known after apply)
      + name              = "scaffold.ly"
      + name_servers      = (known after apply)
      + zone_id           = (known after apply)
    }

Plan: 16 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + main_nameservers = (known after apply)

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```